app/controllers/posts_controller.rb

    def index
        #@posts = Post.all
         @posts = Post.paginate(page: params[:page], per_page: 5)
---
SELECT "posts".* FROM "posts" WHERE (title LIKE '%%') ORDER BY created_at DESC LIMIT $1 OFFSET $2  [["LIMIT", 5], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts"

    def create
        @post = Post.new(post_params)
        # @post.author = current_user
        if @post.save
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "qweqwe"], ["body", "weqweq"], ["created_at", "2021-05-22 14:00:51.648745"], ["updated_at", "2021-05-22 14:00:51.648745"]]

    def update
        @post = Post.find(params[:id])

        if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Post with image12312"], ["updated_at", "2021-05-22 08:20:18.493035"], ["id", 1]]