app/models/user.rb

SELECT "users".* FROM "users" WHERE (lower(username) = 'dimchykus' OR lower(email) = 'dimchykus') ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]
---
  def self.find_for_database_authentication(warden_conditions)
    conditions = warden_conditions.dup
    if login = conditions.delete(:login)
      where(conditions.to_h).where(["lower(username) = :value OR lower(email) = :value", { :value => login.downcase }]).first

SELECT 1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "Dimchykus"], ["LIMIT", 1]]
---
  def validate_username
    if User.where(email: username).exists?